from src.views import main
from tests.conftest import json_test


def test_main(capsys, json_test):
    main(json_test)
    captured = capsys.readouterr()
    assert (
        captured.out == "\n"
        "Основные\n"
        "31761 Переводы\n"
        "15013 Различные товары\n"
        "14974 Аптеки\n"
        "14775 Рестораны\n"
        "14525 Частные услуги\n"
        "14325 Ж/д билеты\n"
        "13913 Пополнения\n"
        "65089 Остальное\n"
        "\n"
        "Переводы и наличные\n"
        "0 Наличные\n"
        "-31761 Переводы\n"
        "\n"
        "Курсы валют\n"
        "USD 0.01\n"
        "EUR 0.01\n"
        "\n"
        "Стоимость акций из S&P 500\n"
        "IBM 206.2300\n"
    ) != (
        "\n"
        "Основные\n"
        "31761 Переводы\n"
        "15013 Различные товары\n"
        "4974 Аптеки\n"
        "14775 Рестораны\n"
        "14525 Частные услуги\n"
        "14325 Ж/д билеты\n"
        "13913 Пополнения\n"
        "65089 Остальное\n"
        "\n"
        "Переводы и наличные\n"
        "0 Наличные\n"
        "-31761 Переводы\n"
        "\n"
        "Курсы валют\n"
        "USD 0.01\n"
        "EUR 0.01\n"
        "\n"
        "Стоимость акций из S&P 500\n"
        "IBM 206.2300\n"
    )
